БухЭксп/InformationRegisters/ОператорыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОператорыЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтпечатокСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступноПодключениеЧерез1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаСтраницуТехническойПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьШаблонСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасширениеФайлаСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДоступноПодключениеБезОГРН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОднородныйОтветНаВсеДокументыПакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриРегистрацииПредставителяТребуетсяМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеподдерживаемыеФорматы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоЭДВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйРазмерПакетаЭД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибкиНедействительныхСертификатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПоддерживаемогоРегистрационногоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаетсяОбменБезПриглашений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/ТипыСинхронизацииСервисаНастроекЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСинхронизацииСервисаНастроекЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияФорматовЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвязьТиповИФорматовЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеДатаАктивности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияОператоровЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияСовместимостиОператоровЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеАбонентовЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияКонтрагентовСоздаваемыхБезусловно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеКлассификатораПолномочийФНСМЧД002</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеКлассификатораПолномочийМЧД003</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеПеречняСпециальныхОбстоятельств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеСопоставленийКлассификатораОграниченийСОбъектамиБЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеКлассификаторовОграниченийМЧД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбновлениеДатыИсключенияСведенийДУЛПредставителяИзМЧД</Name>
					<Comment>Исключение обязательного указания данных документа, удостоверяющего личность физического лица из МЧД</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияДатНачалаДействияУниверсальныхСообщений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СинхронизацияДатПереводаАбонентовИзТакскомВХАБ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/InformationRegisters/ОператорыЭДО/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает коды поддерживаемых типов документов
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Получить коды поддерживаемых типов документов:
// * Используется - Булево - Тип используется по умолчанию
// * Наименование - Строка - Название типа
// * Код - Строка - Код типа
//
Функция КодыПоддерживаемыхТиповДокументов() Экспорт
	
	ТаблицаКодов = Новый ТаблицаЗначений();
	ТаблицаКодов.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	ТаблицаКодов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаКодов.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(4));
	
	НоваяСтрока = ТаблицаКодов.Добавить();
	НоваяСтрока.Используется = Истина;
	НоваяСтрока.Наименование = Нстр("ru='Общеотраслевые'");
	НоваяСтрока.Код = "1000";
	
	НоваяСтрока = ТаблицаКодов.Добавить();
	НоваяСтрока.Используется = Истина;
	НоваяСтрока.Наименование = Нстр("ru='ЭПД'");
	НоваяСтрока.Код = "2000";
	
	НоваяСтрока = ТаблицаКодов.Добавить();
	НоваяСтрока.Наименование = Нстр("ru='Трансграничные'");
	НоваяСтрока.Код = "4000";
	
	Возврат ТаблицаКодов;
	
КонецФункции

// Получить представление о поддерживаемых типах документов.
// 
// Параметры:
//  КодыТипов - Строка, Массив из Строка - Коды типов документов
//  ТаблицаКодовТипов - см. КодыПоддерживаемыхТиповДокументов
// 
// Возвращаемое значение:
//  Строка - Описание поддерживаемых типов документов
//
Функция ПредставлениеПоддерживаемыхТиповДокументов(КодыТипов, ТаблицаКодовТипов = Неопределено) Экспорт
	
	Результат = "";
	
	Если Не ЗначениеЗаполнено(КодыТипов) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаДанных = ?(ТаблицаКодовТипов = Неопределено, КодыПоддерживаемыхТиповДокументов(), ТаблицаКодовТипов);
	КодыТиповДокументов = ?(ТипЗнч(КодыТипов) = Тип("Массив"), КодыТипов, ОбщегоНазначения.JSONВЗначение(КодыТипов));
	
	ПредставленияДокументов = Новый Массив;
	
	Для Каждого КодТипа Из КодыТиповДокументов Цикл
			
		НайденнаяСтрока = ТаблицаДанных.Найти(КодТипа, "Код");
		Если Не НайденнаяСтрока = Неопределено Тогда
			ПредставленияДокументов.Добавить(НайденнаяСтрока.Наименование);
		КонецЕсли;
			
	КонецЦикла;
	
	Результат = ?(ПредставленияДокументов.Количество() = 0, Результат, СтрСоединить(ПредставленияДокументов, ", "));
	
	Возврат Результат;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

#Область СтандартныеПодсистемы

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	
	Методы.Вставить("ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение");
	
КонецПроцедуры

// СтандартныеПодсистемы.ОбновлениеВерсииИБ

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		ДатаПоследнегоИзменения = СинхронизацияЭДО.ДатаПоследнегоИзмененияДанныхСервисаНастроек(
			Перечисления.ТипыСинхронизацииСервисаНастроекЭДО.СинхронизацияОператоровЭДО);
	
		ДвоичныеДанныеКэша = РегистрыСведений.ОператорыЭДО.ПолучитьМакет("ОператорыЭДО");
		ДанныеКэша = СервисНастроекЭДО.ОбработкаРезультатаКаталогОператоров(ДвоичныеДанныеКэша);
		
		Если ДанныеКэша <> Неопределено Тогда
			СервисНастроекЭДО.ОбновитьДанныеОператоровЭлектронногоДокументооборота(ДанныеКэша, ДатаПоследнегоИзменения);
		КонецЕсли;
		
		ОбработкаЗавершена = Истина;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = НСтр("ru = 'Не удалось заполнить кеши операторов ЭДО по причине:'") + Символы.ПС 
			+ ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
	КонецПопытки;
	
	Параметры.ОбработкаЗавершена = ОбработкаЗавершена;
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсиюНачальноеЗаполнение(Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьЗаписи
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ

#КонецОбласти

#КонецОбласти

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает информацию об операторе ЭДО по учетной записи ЭДО, указанной в параметре
//
// Параметры:
//   УчетнаяЗапись - Строка - идентификатор учетной записи ЭДО для поиска оператора ЭДО
//
// Возвращаемое значение:
//   Неопределено, Структура - данные оператора ЭДО с полями:
//     * ИдентификаторОператора - Строка - уникальный идентификатор оператора
//     * Представление - Строка - наименование оператора
//     * ИНН - Строка - ИНН оператора
//     * КПП - Строка - КПП оператора
//     * ОГРН - Строка - ОГРН оператора
//     * СпособОбменаЭД - ПеречислениеСсылка.СпособыОбменаЭД
//     * ОтпечатокСертификата - Строка - отпечаток сертификата оператора
//     * ДоступноПодключениеЧерез1С - Булево - флаг доступности подключения через сервисы 1С
//     * ОтправлятьДополнительныеСведения - Булево - флаг отправки дополнительных сведений
//     * СсылкаНаСтраницуТехническойПоддержки - Строка - ссылка на страницу технической поддержки оператора
Функция ИнформацияОбОператореЭДОУчетнойЗаписи(УчетнаяЗапись) Экспорт
	
	ТаблицаОператоровЭДО = ТаблицаОператоровЭДО();
	ОператорЭДО = Неопределено;
	
	Для Каждого Оператор Из ТаблицаОператоровЭДО Цикл
		
		Если Лев(ВРег(УчетнаяЗапись), СтрДлина(Оператор.ИдентификаторОператора)) = ВРег(Оператор.ИдентификаторОператора) Тогда
			ОператорЭДО = Оператор.ИдентификаторОператора;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ОператорЭДО) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОператорыЭДО.ИдентификаторОператора КАК ИдентификаторОператора,
		|	ОператорыЭДО.Представление КАК Представление,
		|	ОператорыЭДО.ИНН КАК ИНН,
		|	ОператорыЭДО.КПП КАК КПП,
		|	ОператорыЭДО.ОГРН КАК ОГРН,
		|	ОператорыЭДО.СпособОбменаЭД КАК СпособОбменаЭД,
		|	ОператорыЭДО.ОтпечатокСертификата КАК ОтпечатокСертификата,
		|	ОператорыЭДО.ДоступноПодключениеЧерез1С КАК ДоступноПодключениеЧерез1С,
		|	ОператорыЭДО.ОтправлятьДополнительныеСведения КАК ОтправлятьДополнительныеСведения,
		|	ОператорыЭДО.СсылкаНаСтраницуТехническойПоддержки КАК СсылкаНаСтраницуТехническойПоддержки
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|ГДЕ
		|	ОператорыЭДО.ИдентификаторОператора = &ОператорЭДО";
	
	Запрос.УстановитьПараметр("ОператорЭДО", ОператорЭДО);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаДанныхОбОператореЭДО = РезультатЗапроса.Выгрузить();
	
	Результат = Неопределено;
	
	Если ТаблицаДанныхОбОператореЭДО.Количество() > 0 Тогда
		Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаДанныхОбОператореЭДО[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает данные оператора ЭДО по идентификатору
// 
// Параметры:
//  ОператорЭДО - Строка
// 
// Возвращаемое значение:
//  Структура:
//  * ИНН - Строка
//  * КПП - Строка
//  * ОГРН - Строка
//  * Сертификат - Строка
//  * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД
//  * Код - Строка
//  * Наименование - Строка
Функция АктуальныеДанныеОператораЭДО(ОператорЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОператорыЭДО.ИНН КАК ИНН,
		|	ОператорыЭДО.КПП КАК КПП,
		|	ОператорыЭДО.ОГРН КАК ОГРН,
		|	ОператорыЭДО.ОтпечатокСертификата КАК Сертификат,
		|	ОператорыЭДО.СпособОбменаЭД КАК СпособОбмена,
		|	ОператорыЭДО.ИдентификаторОператора КАК Код,
		|	ОператорыЭДО.Представление КАК Наименование
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|ГДЕ
		|	ОператорыЭДО.ИдентификаторОператора = &ИдентификаторОператора";
	
	Запрос.УстановитьПараметр("ИдентификаторОператора", ОператорЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтрокаРезультат = РезультатЗапроса.Выгрузить()[0];
	
	Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаРезультат);
	
КонецФункции

// Параметры:
//  ОператорЭДО - Строка
// 
// Возвращаемое значение:
//  Булево
Функция ПриРегистрацииПредставителяТребуетсяМЧД(ОператорЭДО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОператорыЭДО.ПриРегистрацииПредставителяТребуетсяМЧД КАК ПриРегистрацииПредставителяТребуетсяМЧД
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|ГДЕ
		|	ОператорыЭДО.ИдентификаторОператора = &ИдентификаторОператора
		|	И ОператорыЭДО.ПриРегистрацииПредставителяТребуетсяМЧД = &ПризнакТребуется";
		
	Запрос.УстановитьПараметр("ИдентификаторОператора", ОператорЭДО);
	Запрос.УстановитьПараметр("ПризнакТребуется", "Требуется");
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

// Параметры:
//  ИдентификаторОператора - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ВерсияПоддерживаемогоРегистрационногоПакета(ИдентификаторОператора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОператорыЭДО.ВерсияПоддерживаемогоРегистрационногоПакета КАК ВерсияПоддерживаемогоРегистрационногоПакета
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|ГДЕ
		|	ОператорыЭДО.ДоступноПодключениеЧерез1С
		|	И ОператорыЭДО.ИдентификаторОператора = &ИдентификаторОператора";
		
	Запрос.УстановитьПараметр("ИдентификаторОператора", ИдентификаторОператора);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		
		МинимальнаяВерсияРегПакета = "5.02"; // Минимальная версия, которая поддержана в текущей версии конифгурации
		МаксимальнаяВерсияРегПакета = "5.03"; // Максимальная версия, которая поддержана в текущей версии конфигурации
		
		Версия = Выборка.ВерсияПоддерживаемогоРегистрационногоПакета;
		Если Не ЗначениеЗаполнено(Версия) Тогда
			Версия = МинимальнаяВерсияРегПакета;
		ИначеЕсли СервисЭДОКлиентСервер.СравнитьВерсииФорматовРегистрации(Версия, МинимальнаяВерсияРегПакета) < 0 Тогда
			Версия = МинимальнаяВерсияРегПакета;
		ИначеЕсли СервисЭДОКлиентСервер.СравнитьВерсииФорматовРегистрации(Версия, МаксимальнаяВерсияРегПакета) > 0 Тогда
			Версия = МаксимальнаяВерсияРегПакета;
		КонецЕсли;
		
		Возврат Версия;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Параметры:
//  ИдентификаторОператора - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ОператорПоддерживаетОбменБезПриглашений(ИдентификаторОператора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОператорыЭДО.ПоддерживаетсяОбменБезПриглашений КАК ПоддерживаетсяОбменБезПриглашений
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО
		|ГДЕ
		|	ОператорыЭДО.ДоступноПодключениеЧерез1С
		|	И ОператорыЭДО.ИдентификаторОператора = &ИдентификаторОператора";
		
	Запрос.УстановитьПараметр("ИдентификаторОператора", ИдентификаторОператора);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПоддерживаетсяОбменБезПриглашений;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращаемое значение:
//  ТаблицаЗначений:
//	* ИдентификаторОператора - Строка
//	* Представление - Строка
//	* СпособОбменаЭД - ПеречислениеСсылка.СпособыОбменаЭД
//	* СсылкаНаСтраницуТехническойПоддержки - Строка
Функция ТаблицаОператоровЭДО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОператорыЭДО.ИдентификаторОператора КАК ИдентификаторОператора,
		|	ОператорыЭДО.Представление КАК Представление,
		|	ОператорыЭДО.СпособОбменаЭД КАК СпособОбменаЭД,
		|	ОператорыЭДО.СсылкаНаСтраницуТехническойПоддержки КАК СсылкаНаСтраницуТехническойПоддержки
		|ИЗ
		|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
